000_РОЗНИЦА_ЦЕНТР/src/Documents/ЭлектроннаяНакладная/ЭлектроннаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектроннаяНакладная</name>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОператорДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСтикера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НашаСуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СтатусыЭН/СтатусыЭН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЭН</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЭН</name>
    <type>
      <types>CatalogRef.КодыСтатусовТТН</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ЭлектроннаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЭлектроннаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	ПолучитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыНаСервере()
	СтруктураОтветаЭН = ОбменНПСервер.СтруктураОтветаПоЭНИнициализация(Объект.ДокументОснование);
	
	СтруктураОтветаЭН.НомерТТН = СокрЛП(Объект.Номер);
	СтруктураОтветаЭН.ТТНRef = Объект.ВнешняяСсылка;
	ФайлыДляНакладной = ОбменНПСервер.СохранитьТТНвPDF(СтруктураОтветаЭН);
	
	Объект.ПутьКФайлуТТН = ФайлыДляНакладной.ПутьКФайлуТТН;
	Объект.ПутьКФайлуСтикера = ФайлыДляНакладной.ПутьКФайлуСтикера;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Статусы.Параметры.УстановитьЗначениеПараметра("Регистратор", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПосылкаПолучена(Команда)
	ПосылкаПолученаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПосылкаПолученаНаСервере()
	
	ТекДата = ТекущаяДатаСеанса();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыСтатусовТТН.Ссылка
		|ИЗ
		|	Справочник.КодыСтатусовТТН КАК КодыСтатусовТТН
		|ГДЕ
		|	КодыСтатусовТТН.ОператорДоставки = &ОператорДоставки
		|	И КодыСтатусовТТН.ЗавершающийСтатус";
	
	Запрос.УстановитьПараметр("ОператорДоставки", Объект.ОператорДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтатусТТН = Выборка.Ссылка;
		
		НаборЗаписей = РегистрыСведений.СтатусыЭН.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.ДокументРегистратор.Установить(Объект.Ссылка); 
		НаборЗаписей.Отбор.Период.Установить(ТекДата); 

		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.ДокументРегистратор = Объект.Ссылка; 
		НоваяЗапись.Период 				= ТекДата;
		НоваяЗапись.СтатусЭН   			= СтатусТТН; 
		НаборЗаписей.Записать();  
	КонецЕсли;		

КонецПроцедуры
